app/controllers/offers_controller.rb

  def index
    @offers = Offer.order("created_at desc").find_all_by_playerid(params[:playerid])
	@bulbs = Notification.where('playerid = ?' , params[:playerid]).sum('bulb')

	@offers.each do |offer|
---
SELECT "players".* FROM "players" WHERE "players"."playerid" IS NULL LIMIT 1