app/controllers/players_controller.rb

   def player_home
	if !signed_in?
		redirect_to signin_path
	else
		@player = current_player
		@bulbs = Notification.where('playerid = ?' , @player.playerid).sum('bulb')
---
SELECT "players".* FROM "players" WHERE "players"."playerid" IS NULL LIMIT 1