app/controllers/sessions_controller.rb

  def create
	#@password = Player.authenticate(params[:session][:playerid], params[:session][:password])
	#render '/players/test'

	player = Player.find_by_playerid(params[:session][:playerid])
---
SELECT "players".* FROM "players" WHERE "players"."playerid" = '' LIMIT 1